# access online data
- To store big data sets used CSV files (comma separated files)
- CSV files contains plain text
- Pandas provides the read_csv() function to read data stored as a csv file into a pandas dataframe
- It supports many different file formats (csv, excel, sql, json, â€¦)

In [163]:
import pandas as pd

In [164]:
csvdf = pd.read_csv("DataSet/t.csv")

In [165]:
csvdf = pd.read_csv("http://bit.ly/kaggletrain")

In [166]:
csvdf.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [167]:
csvdf.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### size() function
- The size property returns the number of elements in the dataframe
- The number of elements is the number of rows * the number of columns.

In [168]:
csvdf.size

10692

### shape function
- shape function is used to get the shape of dataframe
- The shape is nothing but a number of rows and columns of the DataFrame
- It returns a tuple where the first element is the number of rows and the second is the number of columns

In [169]:
csvdf.shape

(891, 12)

In [170]:
csvdf.shape[0]

891

In [171]:
csvdf.shape[1]

12

#### write a command to findout avarage age of the pasenger

In [172]:
b = csvdf["Age"].sum()
print(b)
avg = b/891
print(avg)

21205.17
23.79929292929293

In [173]:
avg = csvdf["Age"].sum() / csvdf.shape[0]
print(avg)

23.79929292929293

In [174]:
csvdf["Age"].mean()

29.69911764705882

### unique() funtion
- The unique function in pandas is used to find the unique values from a series
- A series is a single column of a data frame
- It values returned as a umy array

In [175]:
csvdf["Pclass"].unique()

array([3, 1, 2], dtype=int64)

In [176]:
csvdf["Sex"].unique()

array(['male', 'female'], dtype=object)

### Series
- Series is a type of list that can take integer values, string values, double values, and more
- A Series is like a column in a table
- It is a one-dimensional array holding data of any type
- The row labels of series are called the index
- It cannot contain multiple columns
- Thus, say that a Dataframe is a collection of series that be used to analyze the datae.

#### Difference between series and dataframe
- Series can only contain a single list with an index, whereas Dataframe can be made of more than one series
- Series only has one data column, whereas DataFrame contains both a data column and an index
- Series is an analog of a one-dimensional array, whereas DataFrame is an analog of a two-dimensional array
- Series is like a column, whereas DataFrame is the whole table

#### How to convert the series into data frame?

In [177]:
sub = ['JAVA', 'DS', 'PYTHON', 'DBMS']

In [178]:
subsr = pd.Series(sub)

In [179]:
subsr

0      JAVA
1        DS
2    PYTHON
3      DBMS
dtype: object

In [180]:
subdf = pd.DataFrame(subsr)

In [181]:
subdf

        0
0    JAVA
1      DS
2  PYTHON
3    DBMS

#### create 2 different dataframe based on the pacenger's sex (male, female)

In [182]:
maledf = csvdf[csvdf["Sex"] == 'male']

In [183]:
maledf.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S

In [184]:
femaledf = csvdf[csvdf["Sex"] == 'female']

In [185]:
femaledf.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

#### create 3 different dataframe based on the pacenger's class (1,2,3)

In [186]:
d1df = csvdf[csvdf["Pclass"] == 1]

In [187]:
d1df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

In [188]:
d2df = csvdf[csvdf["Pclass"] == 2]

In [189]:
d2df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S

In [190]:
d3df = csvdf[csvdf["Pclass"] == 3]

In [191]:
d3df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S

### value_counts()
- The value_counts() function returns an object containing counts of unique values
- Return a Series containing the frequency of each distinct row in the Dataframe

In [192]:
csvdf['Pclass'].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [193]:
csvdf['Sex'].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64

In [194]:
csvdf['Survived'].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

### How to filter specific rows from a DataFrame?
- For indexing or selecting elements from dataframe used []
- () used to group of conditions within each set

#### Create the dataframe with Pclass = 3 and Sex = female

In [195]:
fdf = csvdf[(csvdf["Pclass"] == 3) & (csvdf["Sex"] == "female")]

In [196]:
fdf.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S

#### Create the dataframe with Pclass = 1 and Sex = male

In [197]:
mdf = csvdf[(csvdf["Pclass"] == 1) & (csvdf["Sex"] == "male")]

In [198]:
mdf.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S

### apply() function
- The apply() method allows you to apply a function along one of the axis of the dataframe
- It takes a function as an input and applies this function to an entire DataFrame

#### write a command for surname that split from name column and insert a column

In [199]:
def surname(x):
    return x.split(',')[0]

In [200]:
csvdf.insert(4, 'Surname', csvdf['Name'].apply(surname))

In [201]:
csvdf.head(2)

,PassengerId,Survived,Pclass,Name,Surname,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",Braund,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Cumings,female,38.0,1,0,PC 17599,71.2833,C85,C

#### calculate half-age funtion and insert a column after the age into given data frame

In [202]:
def half_age(age):
    return age/2

In [203]:
csvdf.insert(7, 'Half Age', csvdf['Age'].apply(half_age))

In [204]:
csvdf.head(2)

,PassengerId,Survived,Pclass,Name,Surname,Sex,Age,Half Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",Braund,male,22.0,11.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Cumings,female,38.0,19.0,1,0,PC 17599,71.2833,C85,C

### map() function
- Map function is works as an iterator to return a result after applying a function to every item of an iterable (tuple, lists, etc.)
- It is used when you want to apply a single transformation function to all the iterable elements
- The iterable and function are passed as arguments to the map in python

In [205]:
gender = csvdf['Sex'].map({'male' : 0, 'female' : 1})

In [206]:
csvdf.insert(6, 'Gender', gender)

In [207]:
csvdf.head(2)

,PassengerId,Survived,Pclass,Name,Surname,Sex,Gender,Age,Half Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",Braund,male,0,22.0,11.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Cumings,female,1,38.0,19.0,1,0,PC 17599,71.2833,C85,C

#### write a python program to load different kind of the file (json, xml, excel etc)

In [208]:
jsondf = pd.read_json('DataSet\j.json')

In [209]:
jsondf.head(2)

   Roll No First Name Last Name  Gender  Age
0      201     Keyuri     Patel  female   21
1      202     Yashvi     Joshi  female   20

In [210]:
xmldf = pd.read_xml('DataSet\\x.xml')

In [211]:
xmldf.head(2)

   Roll_No First_Name Last_Name  Gender  Age
0      301     Keyuri     Patel  female   21
1      302     Yashvi     Joshi  female   20

In [212]:
xlsxdf = pd.read_excel("DataSet/x.xlsx")

In [213]:
xlsxdf.head(2)

   Roll No First Name Last Name  Gender  Age
0      211     Keyuri     Patel  female   21
1      212     Yashvi     Joshi  female   20

## Before processing on data, clean the dataset with appropriate values
- Data cleaning is the process of changing or eliminating garbage, incorrect, duplicate, corrupted, or incomplete data in a dataset
- Most efficient steps to clean data
  - Findout missing values
  - Replace or handle missing values
##### How find out missing values from dataset ?
- To calculate total number of missing values use isnull() method that return boolean value
- isnull() method followed by sum() method that count total missing values  
##### How replace or handle missing values ?
- Filling appropriate values based on their categories
- Dropping unnecessary columns
- Changing the index
- Renaming columns to recognizable
- Skipping unnecessary rows

### Find out missing values from dataset

#### isnull() function
- isnull() function detect missing values in the given series object
- It return a boolean same-sized object indicating if the values are NaN
- It return true for missing values and false for missing values

In [214]:
csvdf.isnull()

,PassengerId,Survived,Pclass,Name,Surname,Sex,Gender,Age,Half Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,False,False,True,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,False,False,True,False

In [215]:
csvdf.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Surname          0
Sex              0
Gender           0
Age            177
Half Age       177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### Replace or handle missing values

#### remove unnecessary column

In [216]:
csvdf.drop(columns=["Cabin"], inplace=True)

In [217]:
csvdf.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Surname', 'Sex', 'Gender',
       'Age', 'Half Age', 'SibSp', 'Parch', 'Ticket', 'Fare', 'Embarked'],
      dtype='object')

In [218]:
csvdf.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Surname          0
Sex              0
Gender           0
Age            177
Half Age       177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

#### Filling appropriate values based on their categories
- Generally, replacing the missing values with the mean/median/mode is a crude way of treating missing values
- For numerical data, find out mean of that data and replace that with mean value
- For categorical data, find out mode of that data and replace that with mode value

##### For filling missing value here find average of each age based on Pclass and create dataframes for each Pclass

In [219]:
csvdf.groupby("Pclass")["Age"].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [220]:
csvdf1 = csvdf[csvdf['Pclass'] == 1]
csvdf2 = csvdf[csvdf['Pclass'] == 2]
csvdf3 = csvdf[csvdf['Pclass'] == 3]

#### fillna() function
- The fillna() method replaces the NULL values with a specified value
- It returns a new dataframe object
- If inplace parameter is set to true, in that case the fillna() method does the replacing in the original dataframe instead.

In [227]:
csvdf1["Age"] = csvdf1["Age"].fillna(csvdf.groupby("Pclass")["Age"].mean()[1])
csvdf2["Age"] = csvdf2["Age"].fillna(csvdf.groupby("Pclass")["Age"].mean()[2])
csvdf3["Age"] = csvdf3["Age"].fillna(csvdf.groupby("Pclass")["Age"].mean()[3])

#### concat() function
- The concat() method is a powerful tool for combine dataframes or series along a particular axis (either rows or columns)
- Itâ€™s especially useful for merging and analyzing datasets with similar structures
- It used to concatenating two dataframe
- Concatenate multiple dataframes using pandas.concat()
- For concatigation, columns and dtype of columns are must be same for each dataframe

In [229]:
csvdf = pd.concat((csvdf1, csvdf2, csvdf3), ignore_index=True)

In [230]:
csvdf.groupby("Pclass")["Age"].mean()

Pclass
1    38.233441
2    29.877630
3    25.140620
Name: Age, dtype: float64

In [224]:
csvdf.head(2)

,PassengerId,Survived,Pclass,Name,Surname,Sex,Gender,Age,Half Age,SibSp,Parch,Ticket,Fare,Embarked
0,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Cumings,female,1,38.0,19.0,1,0,PC 17599,71.2833,C
1,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Futrelle,female,1,35.0,17.5,1,0,113803,53.1000,S

#### Skipping unnecessary rows

#### dropna() function
- The dropna() method removes the rows that contains NULL values
- It returns a new dataframe object
- If inplace parameter is set to true, that case it does the removing in the original DataFrame instead.

In [225]:
csvdf = csvdf.dropna()

In [226]:
csvdf.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Surname        0
Sex            0
Gender         0
Age            0
Half Age       0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64